########################################################################
# 1. 일반 Python 함수
########################################################################
def add(a,b):
    return a + b

result = add(10,20)
print(result)

########################################################################
# 2. LangChain Tool 생성
########################################################################
from langchain_core.tools import tool

# @tool 일반 파이썬 함수를 LLM이 호출 가능한 함수로 변환하는 데코레이터
# tool 이란, LLM이 "행동"할 수 있게 해주는 함수

# doc string이 중요함
# 왜 docstring 중요할까?
# LLM은 이 설명을 읽고: 계산할때 쓰는 함수인걸 알게 됨


@tool
def calculator(a, b):    
    """
    두 숫자를 더하는 계산 Tool 입니다.
    
    입력:
    a : 첫 번째 숫자
    b : 두 번째 숫자
    
    출력:
    두 숫자의 합
    """   
    return a + b

########################################################################
# 3. Toll 정보 확인
########################################################################
print("tool 이름",calculator.name)
print("tool 설명",calculator.description)

# Tool 직접 실행
result = calculator.invoke(
    {
        "a":10,
        "b":20
    }
)
print(result)